# 题目：① 设置随机种子为 42，生成 5 个 0–1 的随机数 
# ②再次运行程序，验证结果一样 
# ③从列表中随机抽 3 个不重复的元素

# 验收标准：

# [ ] ① 两次运行结果完全一致
# [ ] 能说出为什么科研代码必须固定随机种子
# [ ] ③ 用了正确的函数（不重复抽样的那个）

import random

random.seed(42)
x = []
for i in range(5):
    print("=====第一次====")
    print(random.random(),end = "\n")
    x.append(random.random())
# =====第一次====
# 0.6394267984578837
# =====第一次====
# 0.025010755222666936
# =====第一次====
# 0.27502931836911926
# =====第一次====
# 0.22321073814882275
# =====第一次====
# 0.7364712141640124
# Press any key to continue . . 

print(random.sample(x,k = 3))